*************************************************************************
* 이 프로그램은 저작권 법에 따라 보호받는 BR Developer Group의 지적 재산으로서,
* 무단 사용, 무단 복제하는 행위는 금지되어 있으며 법적제재를 받을 수 있습니다.
* 한국 저작권 위원회 등록번호 : C-2018-000076
* Copyright 2018 BR Developer Group All right reserved.
* http://www.brdev.co.kr:8080/flp
* bradryu@hotmail.com
*************************************************************************
*************************************************************************
* MODULES / SUB MODULE :  /
*&---------------------------------------------------------------------
* T_CODE             : ZLBRD00120
* WRITER             : BALV
* DATE               : 2023.08.16
* TYPE               : REPORT
* DESCRIPTION        :
*
*************************************************************************
*              CHANGED HISTORY
*&---------------------------------------------------------------------**
*CHANGED  CHANGED DATE   WRITER       CR No.     DESCRIPTION
*&---------------------------------------------------------------------**
*  N      2023.08.16     BALV                    CREATE       *
*************************************************************************
REPORT ZLBRD00120 NO STANDARD PAGE HEADING.

INCLUDE ZNBRD00010.
INCLUDE ZNBRD00020.
*INCLUDE ZNBRD00030.
INCLUDE ZLBRD00120TOP.
INCLUDE ZLBRD00120F01.
*&---------------------------------------------------------------------**
* INITIALIZATION.
*&---------------------------------------------------------------------**
INITIALIZATION.
  PERFORM SET_INIT_VALUE.
*&---------------------------------------------------------------------*
*& START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM CHECK_AUTHORITY.
  PERFORM GET_BALV_DATA.
*---------------------------------------------------------------------*
* END-OF-SELECTION.
*---------------------------------------------------------------------*
END-OF-SELECTION.
  IF SY-BATCH IS INITIAL.
    CALL SCREEN 100.
  ENDIF.
